ChromeTokyo/MosaicoKeyboard/firmware/dock_handle/examples/keytest/sdkconfig.defaults
# 提案 · 未冻结 · 由 Claude 主控（claude-fable-5-1）起草 · 待 Chrome 采纳、Hiro 复核 · 不得据以制造
#
# 目标与内存配置照抄 esp-mosaico-bsp@392860b1 examples/module_slot_scan/sdkconfig.defaults
#（官方示例对本板的既定配置），去掉了相机相关项。

CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_HZ=1000

# 控制台：左槽 H2 pin13/15 是 USB Serial/JTAG（GPIO33/34），插上手柄模块板后被连接器占用
#（模块板不接这两针），USJ 控制台不可达。缺省走 UART0（官方指南：右槽 H1 提供 TX0 GPIO58 / RX0 GPIO59），
# 需要 USB-UART 转接板。原生 USB-C 的 CDC 控制台见 ../../PC_LINK.md，需 BSP 之外的组件，本示例不启用。
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG is not set

CONFIG_BSP_DISPLAY_ENABLE=y
CONFIG_BSP_CO5300_ENABLE_TE=y

CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_DPI_DEF=130
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y

# dock_handle 默认值（见 ../../Kconfig）
CONFIG_DOCK_HANDLE_POLL_PERIOD_MS=20
CONFIG_DOCK_HANDLE_DEBOUNCE_COUNT=3
CONFIG_DOCK_HANDLE_CLAIM_TIMEOUT_MS=3000
CONFIG_DOCK_HANDLE_AUTO_REATTACH=y
# CONFIG_DOCK_HANDLE_CHECK_IDENTITY is not set
